(ns metrology.lib.gs2000)

(def passports
  "Коэффициенты разбавления генераторов (паспортные значения)."
  [{"serial_number" "58-2-21"
    "air" [1176 513 253 134 70.4 46.8 36.3 24.3 14 10.5]
    "N2" [1196 522 267 136 71.6 47.6 36.9 24.7 14.2 10.7]}
   {"serial_number" "87-1-23"
    "air" [1160 489 237 140 70.3 50.4 34.6 21.8 13.6 10.9]
    "N2" [1180 497 241 142 71.5 51.3 35.2 22.2 13.8 11.1]}
   {"serial_number" "88-2-23"
    "air" [1240 496 283 147 74.4 48.5 34.7 27.7 16.4 11]
    "N2" [1261 504 288 149 75.7 49.3 35.3 28.2 16.7 11.2]}])

(def components 
  "Перечень газов подлежащих разбавлению с помощью генератора,
   согласно РЭ."
  ["NO" "NO2" "N2O" "NH3" "H2" "H2S" "SO2" "O2" "CO"
    "CO2" "CS2" "CH4" "C2H6" "C3H8" "C4H10" "C5H12"
    "C6H14" "CH3OH" "CH3SH" "CH3OCH3" "C2H5OH" "C2H4O"]

(defn map-coefficients
  "Функция отображения мноежства паспортных значений коэффициентов
   K = {k1, k2, ..., k10}
   на множество значений вида
   L = {1/(k1 - 1), 1/(k2 - 1), ..., 1/(k10 - 1)
   для упрощения дальнейших вычислений."
  [coll]
  (map (fn [x] (double (/ 1 (dec x)))) coll)) 

(defn nearest-num
  "Возвращает число из коллекции наиболее близкое к заданному."
  [x coll]
  (first (sort (fn [y z] (cond
                           (< (abs (- y x)) (abs (- z x))) -1
                           (> (abs (- y x)) (abs (- z x))) 1
                           :else 0))
               coll)))

(comment

(nearest-num 6.7 [1 2 3 4 5 6 7 8])

((get pass-coefficients 0) "air")

(map-coefficients ((get passports 0) "air"))

)
